### 引

IT 行业更重要的是技术面. HR 面只是最后一道把关, 检查这个应聘者是否存在一些 "致命缺陷".

所以整体的面试过程, 大家要保持不卑不亢, 淡定从容, 条理清晰, 沉着稳健, 就不会有太大的问题的.

### 有没有男/女朋友

这是一道送命题

不管是不是真的有男女朋友, 统一回答 "没有".

一旦回答有, 分分钟被 HR 问死.

例如:

1. 我们工作地点在北京, 你女朋友不想去北京, 咋办.

   回答 "分手" , HR 认为你性情凉薄, 不适合公司; 回答 "不去北京" , 那 HR 给你发 offer 干啥 [/摊手]

2. 公司需要加班, 你女朋友不同意, 咋办?

   回答同上.

总之, 就是各种 "女朋友不同意" , 真的是分分钟让你想撞墙.

### 期望薪资

这是一道必问送命题.

**千万别回答具体数字!!!**

**千万别回答具体数字!!!**

**千万别回答具体数字!!!**

数字报太高, 人家觉得你狮子大开口, 不要.

数字报太低, 人家觉得你对自己没自信, 不要(也有小公司可能你报个5k, 人家立马同意, 然后在心里偷笑赚大发了, 让你自己后悔去~~).

正确姿势: "作为应届生, 愿意服从公司的安排".

因为你是应届生, 你没有太多的和公司谈判的资本, 并不是你想要那么多, 人家就会给的. (手握大offer的大佬除外, 这个是可以谈判的).

如果 HR 非要给个具体数字, 就根据去年的水平, 报一个薪水范围. 例如 8k - 10k

### 如何看待加班

这是一道送命题.

**千万别回答具体时间!!**

**千万别回答具体时间!!**

**千万别回答具体时间!!**

有大佬回答 "晚上十点" . 那意思是让你工作到十点零一分, 你就不满意了呗?

有大佬回答 "晚上十二点" . 那意思是让你工作到十二点零一分, 你就不满意了呗?

HR 会给你记录 "不能接受加班".

所以统一回答: "作为一个新人, 应该多花时间熟悉公司的业务, 学习技术, 工作时间多长都不重要".

当然, 这不光是嘴上说说, 希望刚参加工作第一年还是要多付出努力. 努力是会有回报的.

### 谈谈职业规划

这个问题不算很送命.

一般套路就是往技术上靠. 提升技术实力, 承担更多的业务线之类的. 总之和 HR 聊技术方向 HR 一般都会比较认可.

不要贸然去谈转管理. 管理这件事情不是什么人都能做到了的.

### 期望工作地点

就是回答公司所在的地点. 同时表现出强烈的对贵公司的兴趣, 非常想去~~

如果公司在一线城市, 可以回答想去大城市打拼;

如果公司在杭州, 珠海, 武汉这种城市, 可以回答消费水平/自然环境等等, 体现出 "稳定" "长期" 这样 HR 想要的关键信息.

或者干脆回答说去哪里都不影响(这个回答略逊一筹, 但是胜在万金油, 不会答错).

即使你非常想去北京, 但是公司在广州, 那也是先说想去广州. 记住, 拿到的 offer 可以再拒. 但是错过的 offer 没法后悔.

### 谈谈对公司的了解

这个根据公司不同, 见招拆招. 墙裂建议面试前先看看公司的官网, 了解一下公司的产品和业务. 这样容易有更多的共同话题.

对于游戏公司, 要求对游戏有更深入的理解.

### 说出三个优点和三个缺点

这是常规问题.

网上有很多固定解法.

优点比较简单, 大家结合自己情况准备即可. 优点要准备好实际的例子为佐证.

缺点不能是真正的缺点, 而要是某些场景下还是优点, 或者缺点无伤大雅, 反而能调节气氛.

例如:

1. 我比较头硬, bug调不出来不想吃饭不想睡觉.
2. 我比较贪吃, 谁和我抢我和谁拼命(适合萌妹子使用. 大老爷们就算了)

千万别说, "我不爱学习", "我沟通能力不行", "不擅长写代码", "喜欢偷懒" .....

虽然这些是真实情况 手动 [/摊手]

### 平时怎么学习

是时候展现真正的技术了~~~~

掏出博客, 掏出 github.

如果没有这些积累的同学, 可以自行去面壁了~~.

但是没关系, 毕竟以后还有社招, 还要跳槽, 所以从现在准备, 以后也用得上.

### 学习成绩

这个要实话实说. 不能造假, 因为有些公司会要求带成绩单(面试/入职时)

如果本身是学霸, 这就很容易.

如果本身是学渣, 挂科无数, 可以说主要精力去学习编程了. 觉得编程更感兴趣更实用所以耽误了学校的课程.

不要说自己天天玩游戏 [/笑哭]

### 为啥不考研

统一回答: 我认为, 对于 IT 行业, 在工作中结合实际的商业项目对自己的技术提升更大.

### 举个栗子证明 ...

这个和自己简历上埋的坑有关. 如果简历上写自我评价, 然后自我评价里写: 我擅长沟通, 组织能力强....

那么 HR 会让你举个栗子证明你组织能力强. 大家提前准备好栗子.

### 遇到过的最大的困难

这个容易暴露上限. 如果你回答的问题其实根本没那么困难, HR 就会觉得你的上限不过如此哇.

例如, 回答考试没考好balabala, HR 就知道了, 原来你还是初中生水平 [/笑哭]

这种也比较适合回答技术上遇到的问题. 提前准备好.

### 最让你伤心的事

这个问题也容易暴漏上限. 但是难度不大. 最稳健的答案是 "亲人去世". 但是如果亲人没去世, 别乱编啊 [/笑哭] 中国人还是要讲究吉利不吉利的~~

### 最让你感动的事

这个问题也容易暴漏上限. 但是难度更低. 最稳健的答案就是 "亲情", 尤其是 父母恩情. 这个大家好好总结, 都不难想.

千万别说你男朋友给你送个花好感动(HR: 蛤? 刚才不是说没男盆友嘛??)

### 给你100w怎么花(cvte)

在离公司距离合适的位置买房. 体现出你的 "稳定性"

### BAToffer 你选哪个

这是一道送命题.

回答任何一个都凉凉.

一定要回答, 选择贵公司(就是你面试的那家公司). 该舔的要舔.

原因需要下点功夫做做功课. 了解公司的优势和特色, 才好舔. 尤其是在某些垂直领域第一的公司, 还是很好舔的.

另外还要注意, 只能舔贵公司, 但是不能 "黑" 其他公司. 在背后说别人坏话这是面试中的 **大忌**

### 腾讯和我们公司都给你offer了你去哪个

答案同上.

### 如何评价我们公司和网易(完美的面试题)

同类型题目, 其实 HR 就是想听你舔她.

### 行业技术发展趋势

这个需要靠平时的积累. 多关注行业新闻动态吧. 这也是能提前准备的问题.

### 手里是否有其他offer

如实回答. 没有 offer 的不要伪造. 有 offer 的不要隐瞒. HR 不会因为你手里有 offer 就不给你发, 相反, 你手里的 offer 会成为你优秀的佐证, 也是你谈薪资的筹码. 但是虽然说有其他 offer , 要马上表态, 表达出我对贵公司非常感兴趣, 特别想加入贵公司~~.

有些大佬可能 offer 拿了 7, 8 个, 这种情况别全说. 要是说有 8 个 offer, 人家怕是觉得你是来面着玩的~~ 所以挑两个大的说说即可.

### 一个优秀的开发人员应该具有哪些特质

这个比较简单一些.

技术素养 + 分析问题解决问题的能力 + 学习能力 + 沟通能力 + 产品的理解深度 ...

按照自己的理解回答即可~

HR 可能会追问, 那么如何展现出自己的这些能力.

这一定是用结果说话. 能够让项目保质保量完成, 为团队带来收益, 这是最好的证明. 公司只看功劳, 不看苦劳.

### 你投递c++，但是到时可能会让你转方向比如JAVA，你还愿意来吗

同类问题:

你投递服务器开发, 现在让你转前端, 你愿意来嘛?

你投递开发, 现在让你转测试, 你愿意来嘛?

愿意. 大家要记得, 面向工资编程. 只要钱给到位, 这些都不是问题.

而且, 咱们还都是一张白纸, 技术方向有很多, 没有高低贵贱之分, 到你适合哪个方向, 这要真正经历过才知道.

而且如果后期觉得不合适, 还可以内部转岗/跳槽. 社招的选择空间比校招大很多.

正确回答姿势: 参考张鹏霄大佬的回答

```
虽然我主要使用的是c++，但是我觉得语言间都是互通的，即不存在很大的转换的成本。

此外，我觉得贵司的业务与具体的开发方向和我个人的兴趣非常的契合

最后，我觉得，代码之外，做工程的能力也很重要。

综上，这都是小问题啦

```

### 你选择公司看重什么

回答: 技术成长. 虽然实际心里想的是 "钱" , 但是不要嘴上说出来. 和 HR 聊天比较为重的做法就是尽量往技术上扯, 体现自己是一个对技术非常有兴趣的人.

### 什么时候能来公司实习/能够实习多长时间
如果是已经拿到正式 offer, 实习时间是不影响的, 根据自己的情况来决定.
如果是应聘实习生, 一定要回答 "随时都可以". 如果回答 "学校不放人" 一定凉凉.
先拿到 offer 再解决学校的问题.

### 学校不放人去实习怎么办?
溜. 学校只是为了自己的管理方便, 因此肯定不会放人. 并没有从学生的利益老考虑.
因此我们只能想办法隐瞒学校, 偷偷过去实习. 大不了被发现了再回来.

实习时间越长越好. 如果只实习一个月两个月, 是基本没啥意义的.

### 为什么井盖是圆的
这是一个相当蛋疼的问题, 但是出现频率又很高.

参考链接:

https://www.jianshu.com/p/a4cec7e80b0a

实际上也有很多不是圆型的井盖的~~~


### 请你评价一下你的队友/室友/同学

送命题.

注意!!! 千万不要背后说人坏话! 千万不要背后说人坏话! 千万不要背后说人坏话!

在背后说别人 "不好", "不行" 之类的话, 面试是 100% 凉的. HR 会认为你品行不端正.

这种时候就适当的吹一吹自己的队友/室友/同学就好(当然, 也别吹的太夸张).

另外, 切忌不要在吹别人的时候 "贬低自己".

**反面教材**: 有同学在面试中被问到这个问题, 先吹了一波队友, 然后说队里就自己是最菜的. 面试官就会觉得你的技术不行/没自信.

该谦虚的时候要谦虚, 但是面试的时候你谦虚, 会被面试官解读成 "真的不行".


### 如果让你从你的宿舍中踢掉一个人, 踢谁?

送命题.

是上一道题的变种. 本质上是一样的.

如果你和你的室友住了三年, 还不能融洽相处(还想着踢人家), 那面试官会认为你和公司的同事也不能很好相处.

注意!!! 千万不要背后说人坏话! 千万不要背后说人坏话! 千万不要背后说人坏话!

正确答案: 谁都不踢. 我们关系非常好, 亲如兄弟, 情同手足. (当然, 实际情况不一定是这样).

如果面试官非要逼你踢一个人, 那就还是强调, "谁都不踢. 如果非要踢, 那就牺牲自己吧. "


### 当你的队友出现拖后腿的情况你怎么办?

送命题.

假设你和队友/同学一起做一个项目, 发现有同学跟不上大家的节奏, 拖了大家后腿, 咋办?

**作死回答1: ** 把他踢了. 理由同上两问.

**作死回答2: ** 队友们都挺厉害的, 就我最菜. 面试官直接认为你技术不行.

**作死回答3: ** 是队长任务分配的不合理, 要给队友分配匹配能力的任务. 首先这里你指责了队长不好. 同时分配任务并不能从根本上解决这个问题.

**正确回答: ** 我会竭尽可能帮助这个队友, 让他和我们一起成长.

共同成长是公司的普遍的文化. 尤其是应届生刚进公司, 什么都不会, 这个时候会收到很多前辈的帮助和包容. 这才是普遍也正确的做法.

### 如果周末, 你的领导让你去帮他送个东西(私事, 和工作无关), 你会怎么办
出自多益网络.
这个问题不是太尖锐. 一般回答 "愿意" 就可以. 问题不大.

### 有出差的意愿嘛
统一回答: "服从公司安排".
有些公司就是会出差很多(比如华为这种). 出差这个事情大部分人是不愿意的. 但是如果直接说不愿意, 可能直接就凉了. 最好还是先答应着, 拿到 offer, 后面再说.

### 公司分部怎么选择--比较偏向哪个城市
统一回答: "服从公司安排".
如果非要让你选, 那么尽量选择北京, 深圳, 上海.
不要想着二线城市消费水平低, 其实一线城市除了房价, 其他方面的消费都和二线城市一样. 但是工资和工资成长差了一大截.
虽然应届生工资可能差不多. 比如 上海给 7.5k, 苏州给 7k. 那么三年之后, 在苏州的话可能也就是 8-9k;
但是在上海, 可能达到 17k. 要把格局放的远一点.

### 月薪给你 20k 够不够?
出自伴鱼h
错误回答: 啊啊啊啊啊, 我感觉我不值这么多钱, 给个 14k 就好.
这样的回答非常不好.
1. hr 会认为你没自信, offer 直接可能就凉了.
2. hr 一看, 得嘞, 成交. 保准你肠子都悔青了.
注意: hr 说这话的意思就是公司真能掏出 20k 的月薪. 这个时候 不要拒绝! 不要拒绝! 不要拒绝!
正确回答: 愿意服从公司的安排.
PS: 伴鱼是做少儿英语培训的公司, 贼有钱(虽然名气不大). 同类公司还有: 虾皮, 云账户, vipkid, 地平线机器人 等.

### 西安的洒水车放的音乐是什么
考察同学是否认真观察生活中的细节.
西安洒水车的音乐版本有好几个. 最常见的有两个:
1. 小小世界(迪士尼的主题曲, 也是小学课本上的一首歌曲)
2. 兰花草(童谣)

### 总结
孙子兵法云, 多算胜, 少算不胜, 而况于无算乎?
汤老湿教大家的不是骗人, 而是一点点的套路.
讲道理, HR 的套路多了去了, 咱们稍微懂一点, 不过分.
正是, 城市套路深, 我要回农村; 农村地也滑, 人心更复杂~
多做准备, 肯定能拿到 心仪的 offer !