# 文件

# 文件是什么

# 数据都是保存在硬盘上的！
# 电影  mp4
# 歌曲  mp3
# 图片  jpg
# 文本  txt
# 表格  xlsx

# CPU,存储器，输入设备，输出设备
# 存储器-->
# 1.内存    变量，就是在内存中
# 2.硬盘    文件，就是在硬盘中

# 1.内存的空间更小，硬盘空间更大
# 2.内存访问更快，硬盘访问更慢
# 3.内存成本更贵，硬盘成本更便宜
# 4.内存的数据易失，硬盘的数据持久化存储(硬盘上存储的数据就是以文件的形式来组织的)

# 此电脑 => C盘，D盘~这里的内容都是硬盘上的内容，也都是文件！
# 文件夹（目录）也是一种特殊的文件，目录文件（——Linux下一切皆文件）

# 此电脑这个称呼有个有趣的小发展——
# windows xp  我的电脑
# windows7    计算机
# windows8    这台电脑
# windows10   此电脑
# windows11   此电脑(居然没延续改名的传统，有点小失望)

# 即使都是文件，文件里面存储数据的内容 / 格式，也是差异很大的
# 我们重点学习文本文件